{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "30"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "29"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_48", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_37", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_27/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_7/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_6/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_3/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_49", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "28"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_3/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_46", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_36", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_31/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_8/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_7/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_7/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_47", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "27"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_5/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_35/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_9/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_8/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_11/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_45", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "26"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_7/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_42", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_39/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_10/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_9/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_15/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_24", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_43", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "25"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_9/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_33", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_43/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_11/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_10/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_19/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_41", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "24"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_11/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_38", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "452"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.less/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.gather/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_47/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.reshape/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_12/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_11/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_23/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.concat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_50", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_52", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "30"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.math.less/Less", "op": "Less", "input": ["input", "PartitionedCall/model_60/tf.math.less/Less/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.math.equal/Equal", "op": "NotEqual", "input": ["input", "unknown"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/model_60/tf.cast/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.less/Less"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_1/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.multiply/Mul", "op": "Mul", "input": ["PartitionedCall/model_60/tf.cast/Cast", "unknown_0"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.reshape/Reshape", "op": "Reshape", "input": ["PartitionedCall/model_60/tf.cast_1/Cast", "PartitionedCall/model_60/tf.reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_60/tf.__operators__.add/AddV2", "op": "AddV2", "input": ["input", "PartitionedCall/model_60/tf.math.multiply/Mul"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_7/transpose", "op": "Transpose", "input": ["PartitionedCall/model_60/tf.reshape/Reshape", "PartitionedCall/model_60/tf.compat.v1.transpose_7/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_8/transpose", "op": "Transpose", "input": ["PartitionedCall/model_60/tf.reshape/Reshape", "PartitionedCall/model_60/tf.compat.v1.transpose_8/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_9/transpose", "op": "Transpose", "input": ["PartitionedCall/model_60/tf.reshape/Reshape", "PartitionedCall/model_60/tf.compat.v1.transpose_9/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_10/transpose", "op": "Transpose", "input": ["PartitionedCall/model_60/tf.reshape/Reshape", "PartitionedCall/model_60/tf.compat.v1.transpose_10/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_11/transpose", "op": "Transpose", "input": ["PartitionedCall/model_60/tf.reshape/Reshape", "PartitionedCall/model_60/tf.compat.v1.transpose_11/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.transpose_12/transpose", "op": "Transpose", "input": ["PartitionedCall/model_60/tf.reshape/Reshape", "PartitionedCall/model_60/tf.compat.v1.transpose_12/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.gather/GatherV2", "op": "GatherV2", "input": ["unknown_1", "PartitionedCall/model_60/tf.__operators__.add/AddV2", "PartitionedCall/model_60/tf.compat.v1.gather/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_6/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.transpose_7/transpose", "PartitionedCall/model_60/tf.expand_dims_6/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_7/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.transpose_8/transpose", "PartitionedCall/model_60/tf.expand_dims_7/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_8/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.transpose_9/transpose", "PartitionedCall/model_60/tf.expand_dims_8/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_9/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.transpose_10/transpose", "PartitionedCall/model_60/tf.expand_dims_9/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_10/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.transpose_11/transpose", "PartitionedCall/model_60/tf.expand_dims_10/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.expand_dims_11/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.transpose_12/transpose", "PartitionedCall/model_60/tf.expand_dims_11/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_60/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.avg_pool/AvgPool", "op": "AvgPool", "input": ["PartitionedCall/model_60/tf.expand_dims_6/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_1/AvgPool", "op": "AvgPool", "input": ["PartitionedCall/model_60/tf.expand_dims_7/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "3", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_2/AvgPool", "op": "AvgPool", "input": ["PartitionedCall/model_60/tf.expand_dims_8/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "4", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_3/AvgPool", "op": "AvgPool", "input": ["PartitionedCall/model_60/tf.expand_dims_9/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "5", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_4/AvgPool", "op": "AvgPool", "input": ["PartitionedCall/model_60/tf.expand_dims_10/ExpandDims"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "6", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_5/AvgPool", "op": "AvgPool", "input": ["PartitionedCall/model_60/tf.expand_dims_11/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "7", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/ExpandDims", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims", "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.squeeze_8/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.avg_pool/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.squeeze_10/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_1/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.squeeze_12/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_2/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.squeeze_14/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_3/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.squeeze_16/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_4/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.squeeze_18/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.avg_pool_5/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["2"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_60/tf.math.equal_1/Equal", "op": "Equal", "input": ["PartitionedCall/model_60/tf.compat.v1.squeeze_8/Squeeze", "unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/model_60/tf.math.equal_2/Equal", "op": "Equal", "input": ["PartitionedCall/model_60/tf.compat.v1.squeeze_10/Squeeze", "unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/model_60/tf.math.equal_3/Equal", "op": "Equal", "input": ["PartitionedCall/model_60/tf.compat.v1.squeeze_12/Squeeze", "unknown_8"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/model_60/tf.math.equal_4/Equal", "op": "Equal", "input": ["PartitionedCall/model_60/tf.compat.v1.squeeze_14/Squeeze", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/model_60/tf.math.equal_5/Equal", "op": "Equal", "input": ["PartitionedCall/model_60/tf.compat.v1.squeeze_16/Squeeze", "unknown_4"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/model_60/tf.math.equal_6/Equal", "op": "Equal", "input": ["PartitionedCall/model_60/tf.compat.v1.squeeze_18/Squeeze", "unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "PartitionedCall/model_60/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d/conv1d/Squeeze", "unknown_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.add_1/Add", "op": "AddV2", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_1/conv1d/Squeeze", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.add_2/Add", "op": "AddV2", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_2/conv1d/Squeeze", "unknown_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.add_3/Add", "op": "AddV2", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_3/conv1d/Squeeze", "unknown_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.add_4/Add", "op": "AddV2", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_4/conv1d/Squeeze", "unknown_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.add_5/Add", "op": "AddV2", "input": ["PartitionedCall/model_60/tf.compat.v1.nn.conv1d_5/conv1d/Squeeze", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.cast_3/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_1/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_2/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_1/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_5/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_2/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_4/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_2/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_7/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_3/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_6/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_3/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_9/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_4/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_8/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_4/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_11/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_5/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_10/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_5/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_13/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_6/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.cast_12/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.equal_6/Equal"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_60/tf.math.add/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.nn.relu_1/Relu", "op": "Relu", "input": ["PartitionedCall/model_60/tf.math.add_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.nn.relu_2/Relu", "op": "Relu", "input": ["PartitionedCall/model_60/tf.math.add_2/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.nn.relu_3/Relu", "op": "Relu", "input": ["PartitionedCall/model_60/tf.math.add_3/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.nn.relu_4/Relu", "op": "Relu", "input": ["PartitionedCall/model_60/tf.math.add_4/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.nn.relu_5/Relu", "op": "Relu", "input": ["PartitionedCall/model_60/tf.math.add_5/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_3/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.cast_2/Cast", "PartitionedCall/model_60/tf.math.reduce_sum_3/Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_7/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.cast_4/Cast", "PartitionedCall/model_60/tf.math.reduce_sum_7/Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_11/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.cast_6/Cast", "PartitionedCall/model_60/tf.math.reduce_sum_11/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_15/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.cast_8/Cast", "PartitionedCall/model_60/tf.math.reduce_sum_15/Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_19/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.cast_10/Cast", "PartitionedCall/model_60/tf.math.reduce_sum_19/Sum/reduction_indices"], "attr": {"T": {"type": "DT_INT64"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_23/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.cast_12/Cast", "PartitionedCall/model_60/tf.math.reduce_sum_23/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT64"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.where/SelectV2", "op": "SelectV2", "input": ["PartitionedCall/model_60/tf.math.equal_1/Equal", "PartitionedCall/model_60/tf.nn.relu/Relu", "unknown_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.multiply_4/Mul", "op": "Mul", "input": ["PartitionedCall/model_60/tf.nn.relu/Relu", "PartitionedCall/model_60/tf.cast_3/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.where_1/SelectV2", "op": "SelectV2", "input": ["PartitionedCall/model_60/tf.math.equal_2/Equal", "PartitionedCall/model_60/tf.nn.relu_1/Relu", "unknown_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.multiply_8/Mul", "op": "Mul", "input": ["PartitionedCall/model_60/tf.nn.relu_1/Relu", "PartitionedCall/model_60/tf.cast_5/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.where_2/SelectV2", "op": "SelectV2", "input": ["PartitionedCall/model_60/tf.math.equal_3/Equal", "PartitionedCall/model_60/tf.nn.relu_2/Relu", "unknown_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.multiply_12/Mul", "op": "Mul", "input": ["PartitionedCall/model_60/tf.nn.relu_2/Relu", "PartitionedCall/model_60/tf.cast_7/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.where_3/SelectV2", "op": "SelectV2", "input": ["PartitionedCall/model_60/tf.math.equal_4/Equal", "PartitionedCall/model_60/tf.nn.relu_3/Relu", "unknown_25"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.multiply_16/Mul", "op": "Mul", "input": ["PartitionedCall/model_60/tf.nn.relu_3/Relu", "PartitionedCall/model_60/tf.cast_9/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.where_4/SelectV2", "op": "SelectV2", "input": ["PartitionedCall/model_60/tf.math.equal_5/Equal", "PartitionedCall/model_60/tf.nn.relu_4/Relu", "unknown_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.multiply_20/Mul", "op": "Mul", "input": ["PartitionedCall/model_60/tf.nn.relu_4/Relu", "PartitionedCall/model_60/tf.cast_11/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.where_5/SelectV2", "op": "SelectV2", "input": ["PartitionedCall/model_60/tf.math.equal_6/Equal", "PartitionedCall/model_60/tf.nn.relu_5/Relu", "unknown_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.multiply_24/Mul", "op": "Mul", "input": ["PartitionedCall/model_60/tf.nn.relu_5/Relu", "PartitionedCall/model_60/tf.cast_13/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_60/tf.math.greater/Greater", "op": "Greater", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_3/Sum", "unknown_37"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.cast_14/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_3/Sum"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.greater_1/Greater", "op": "Greater", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_7/Sum", "unknown_36"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.cast_15/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_7/Sum"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.greater_2/Greater", "op": "Greater", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_11/Sum", "unknown_35"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.cast_16/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_11/Sum"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.greater_3/Greater", "op": "Greater", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_15/Sum", "unknown_34"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.cast_17/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_15/Sum"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.greater_4/Greater", "op": "Greater", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_19/Sum", "unknown_33"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.cast_18/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_19/Sum"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.greater_5/Greater", "op": "Greater", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_23/Sum", "unknown_32"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_60/tf.cast_19/Cast", "op": "Cast", "input": ["PartitionedCall/model_60/tf.math.reduce_sum_23/Sum"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_1/Max", "op": "Max", "input": ["PartitionedCall/model_60/tf.where/SelectV2", "PartitionedCall/model_60/tf.math.reduce_max_1/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_27/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.math.multiply_4/Mul", "PartitionedCall/model_60/tf.math.reduce_sum_27/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_3/Max", "op": "Max", "input": ["PartitionedCall/model_60/tf.where_1/SelectV2", "PartitionedCall/model_60/tf.math.reduce_max_3/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_31/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.math.multiply_8/Mul", "PartitionedCall/model_60/tf.math.reduce_sum_31/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_5/Max", "op": "Max", "input": ["PartitionedCall/model_60/tf.where_2/SelectV2", "PartitionedCall/model_60/tf.math.reduce_max_5/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_35/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.math.multiply_12/Mul", "PartitionedCall/model_60/tf.math.reduce_sum_35/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_7/Max", "op": "Max", "input": ["PartitionedCall/model_60/tf.where_3/SelectV2", "PartitionedCall/model_60/tf.math.reduce_max_7/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_39/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.math.multiply_16/Mul", "PartitionedCall/model_60/tf.math.reduce_sum_39/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_max_9/Max", "op": "Max", "input": ["PartitionedCall/model_60/tf.where_4/SelectV2", "PartitionedCall/model_60/tf.math.reduce_max_9/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_60/tf.math.reduce_sum_43/Sum", "op": "Sum", "input": ["PartitionedCall/model_60/tf.math.multiply_20/Mul", "PartitionedCall/model_60/tf.math.reduce_sum_43/Sum/reduction_indices"], "attr": {"T": 