{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "100"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "2"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_3/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "4"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_5/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_7/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_9/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "452"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.less/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.gather/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "7"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_11/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_12/tf.concat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "100"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_12/tf.math.less/Less", "op": "Less", "input": ["input", "PartitionedCall/model_12/tf.math.less/Less/y"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_12/tf.cast/Cast", "op": "Cast", "input": ["PartitionedCall/model_12/tf.math.less/Less"], "attr": {"SrcT": {"type": "DT_BOOL"}, "DstT": {"type": "DT_INT64"}, "Truncate": {"b": false}}}, {"name": "PartitionedCall/model_12/tf.math.multiply/Mul", "op": "Mul", "input": ["PartitionedCall/model_12/tf.cast/Cast", "unknown"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_12/tf.__operators__.add/AddV2", "op": "AddV2", "input": ["input", "PartitionedCall/model_12/tf.math.multiply/Mul"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.gather/GatherV2", "op": "GatherV2", "input": ["unknown_0", "PartitionedCall/model_12/tf.__operators__.add/AddV2", "PartitionedCall/model_12/tf.compat.v1.gather/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_12/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_12/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_12/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_12/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_12/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/model_12/tf.compat.v1.gather/GatherV2", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d", "op": "Conv2D", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims", "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "PartitionedCall/model_12/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/Squeeze", "unknown_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.add_1/Add", "op": "AddV2", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/Squeeze", "unknown_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.add_2/Add", "op": "AddV2", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/Squeeze", "unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.add_3/Add", "op": "AddV2", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/Squeeze", "unknown_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.add_4/Add", "op": "AddV2", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/Squeeze", "unknown_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.add_5/Add", "op": "AddV2", "input": ["PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/Squeeze", "unknown_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_1/Max", "op": "Max", "input": ["PartitionedCall/model_12/tf.math.add/Add", "PartitionedCall/model_12/tf.math.reduce_max_1/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_3/Max", "op": "Max", "input": ["PartitionedCall/model_12/tf.math.add_1/Add", "PartitionedCall/model_12/tf.math.reduce_max_3/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_5/Max", "op": "Max", "input": ["PartitionedCall/model_12/tf.math.add_2/Add", "PartitionedCall/model_12/tf.math.reduce_max_5/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_7/Max", "op": "Max", "input": ["PartitionedCall/model_12/tf.math.add_3/Add", "PartitionedCall/model_12/tf.math.reduce_max_7/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_9/Max", "op": "Max", "input": ["PartitionedCall/model_12/tf.math.add_4/Add", "PartitionedCall/model_12/tf.math.reduce_max_9/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_11/Max", "op": "Max", "input": ["PartitionedCall/model_12/tf.math.add_5/Add", "PartitionedCall/model_12/tf.math.reduce_max_11/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/model_12/tf.concat/concat", "op": "ConcatV2", "input": ["PartitionedCall/model_12/tf.math.reduce_max_1/Max", "PartitionedCall/model_12/tf.math.reduce_max_3/Max", "PartitionedCall/model_12/tf.math.reduce_max_5/Max", "PartitionedCall/model_12/tf.math.reduce_max_7/Max", "PartitionedCall/model_12/tf.math.reduce_max_9/Max", "PartitionedCall/model_12/tf.math.reduce_max_11/Max", "PartitionedCall/model_12/tf.concat/concat/axis"], "attr": {"N": {"i": "6"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_12/tf.concat/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.__operators__.add_1/AddV2", "op": "_FusedMatMul", "input": ["PartitionedCall/model_12/tf.nn.relu/Relu", "unknown_13", "unknown_15"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/tf.math.sigmoid/Sigmoid", "op": "Sigmoid", "input": ["PartitionedCall/model_12/tf.__operators__.add_1/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_12/output/wa/Squeeze", "op": "Squeeze", "input": ["PartitionedCall/model_12/tf.math.sigmoid/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/model_12/output/wa/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d/conv1d/ExpandDims_1", "shape": [1, 2, 64, 32], "dtype": "float32"}, {"name": "unknown_12", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_1/Max/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_1/conv1d/ExpandDims_1", "shape": [1, 3, 64, 32], "dtype": "float32"}, {"name": "unknown_11", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_3/Max/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_2/conv1d/ExpandDims_1", "shape": [1, 4, 64, 32], "dtype": "float32"}, {"name": "unknown_10", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_5/Max/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_3/conv1d/ExpandDims_1", "shape": [1, 5, 64, 32], "dtype": "float32"}, {"name": "unknown_9", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_7/Max/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_4/conv1d/ExpandDims_1", "shape": [1, 6, 64, 32], "dtype": "float32"}, {"name": "unknown_8", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_9/Max/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "unknown_0", "shape": [452, 64], "dtype": "float32"}, {"name": "PartitionedCall/model_12/tf.math.less/Less/y", "shape": [], "dtype": "int32"}, {"name": "unknown", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.gather/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.compat.v1.nn.conv1d_5/conv1d/ExpandDims_1", "shape": [1, 7, 64, 32], "dtype": "float32"}, {"name": "unknown_7", "shape": [32], "dtype": "float32"}, {"name": "PartitionedCall/model_12/tf.math.reduce_max_11/Max/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/model_12/tf.concat/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_13", "shape": [192, 1], "dtype": "float32"}, {"name": "unknown_15", "shape": [1], "dtype": "float32"}]}]}