[PAD]
[UNK]
[CLS]
[SEP]
:
✈️
😡
😎
😱
😮
🤯
🍑
🔥
🥰
🍀
🙏
ai
a
gui
de
ji
ben
pan
fan
yi
ci
shi
chao
wan
mi
xue
tuan
yu
ying
wei
da
nv
cheng
zhan
lve
he
zuo
bu
wo
jian
ba
piao
shen
jia
ge
yong
jiu
ding
o
zhe
yang
nin
ke
wu
xian
zhi
ti
gao
ran
you
fu
fei
ju
feng
dao
zhong
dui
biao
fa
hui
xing
zhen
hen
diao
chang
shan
zhai
hao
han
hai
su
qi
pu
xuan
ze
ri
lu
bao
hu
yin
si
jie
dian
zai
xiao
huo
nao
duan
dou
chi
sheng
ban
zhuan
wen
liu
shui
gong
zhu
na
me
gai
zen
cao
ne
mo
n
xi
tong
bi
suo
fen
liang
zou
dai
li
gen
yuan
ni
shou
guo
qing
mei
qu
wang
luo
xiang
guan
liao
pei
shang
cai
bai
tu
di
xia
ma
te
e
ce
se
mai
shu
tai
huan
gei
shuo
gan
jin
yao
rang
zhou
tui
chui
cang
bei
lai
ta
men
la
hei
kuai
zhang
xun
cun
chu
er
hua
qun
ren
diu
lian
kao
sha
gu
pao
ye
💛
🎵
🏆
✌️
💦
lao
zao
suan
dong
zi
mao
ca
jue
xin
jiao
du
quan
ming
dan
qiu
pen
gou
sai
kong
ting
hou
jiang
kan
bo
ku
niu
zong
tou
hong
lv
le
ru
jing
zheng
chuai
zhuang
min
dang
bang
neng
pian
duo
bie
chuan
yan
lo
sui
che
she
ao
yue
ning
🐬
🤝
🍾
✋
💋
zhui
bian
cong
qia
ya
chou
ping
zui
wai
zhuo
nian
fang
mian
chun
qian
tian
kai
🌸
😊
❤️‍🔥
😂
🌠
😏
🎈
❤️
long
kou
🌹
😆
🥳
😇
😉
👌
🤞
🎯
zu
nei
qiao
nan
nong
huai
que
lun
tan
sun
sang
bing
pi
ka
guang
mou
lei
ling
cu
pa
sou
tiao
lan
gua
xie
qiang
qie
xu
tuo
za
nie
miao
mu
lang
wa
rong
en
juan
an
lin
shao
san
kui
xiu
cha
peng
jun
huang
tie
geng
💃
🙌
😄
☀️
deng
rui
🍒
😁
✨
🙂
💚
🎀
🤲
🌷
💌
🥲
🪅
🎉
🤑
🌟
zhua
tang
kuo
chong
pai
bin
⚡
😋
💎
ken
zhao
beng
shun
ceng
chuang
man
chen
🩷
🌴
💍
❣️
po
kua
zhun
song
pin
luan
ruan
gang
qin
die
guai
m
ng
nve
chan
meng
lie
ruo
🍓
🎇
can
tao
ou
⭐
🕺
🤩
🤍
keng
🫶
🤓
xiong
💞
☺️
🌙
ha
yun
💖
👍
wong
💫
💥
cuo
fou
kuan
kun
🎎
🦬
🧺
👅
🐵
❇️
↖️
😀
🎊
🤡
🤨
🌻
🥹
🫡
🎆
🫵
🫰
🤭
🖐️
🚀
🎶
run
kang
nuo
niao
cui
💪
dia
pang
lia
re
🥂
😍
🌊
dun
lou
🤎
🦋
🌲
☝️
rou
🍻
🍎
😓
😪
👐
shua
nai
teng
nu
kuang
🍌
🤏
💟
❄️
⚡️
👙
🙅‍♂️
💅
💧
🤙
💝
💗
🪐
👏
🖤
💜
😚
🫦
🆚
💹
♑️
😅
🌼
⬅️
📱
🤸
🌿
👆
shuang
mang
zei
den
zha
sa
hun
🌪️
👄
💘
💙
🔆
💨
😑
🐾
🌈
💄
☔️
❗️
👑
🤗
cuan
sao
ga
fo
leng
shuai
🌺
zuan
🏉
🏹
🪓
🩱
📷
ei
niang
🌐
🥄
🌵
🤮
⚱️
🦧
🙉
zan
🍁
🌧
🚳
🪒
🔱
🍹
🐂
👎
😹
🌫️
👠
🧡
💕
🎦
🚭
🐔
💻
🔺
🎨
zun
🤣
chai
rao
chuo
hang
mie
tun
len
gun
🥸
☯
🪱
🚗
😰
sen
heng
©