[PAD]
[UNK]
[CLS]
[SEP]
:
✈️
😡
😎
😱
😮
🤯
🍑
🔥
🥰
🍀
🙏
mi
zu
sa
kan
a
zhu
ge
liang
he
si
ma
yi
jing
ran
you
long
yang
zhi
pi
ta
zhen
zheng
xiang
shuo
de
shi
fen
shou
hou
hai
neng
zuo
pao
chuan
xia
qu
nan
tong
le
o
n
zai
zei
shang
gei
ji
hui
tui
te
di
mei
men
wen
zhe
xu
pin
fan
liao
na
zhong
peng
ga
ming
wan
ban
lai
pan
tu
jie
bu
ren
dui
hua
lao
sha
zi
ying
xiao
hao
tou
fa
dou
yan
fei
cha
dian
jiu
bei
pian
guo
shun
yue
du
yao
da
jue
ye
qing
chu
shen
me
ao
yu
bie
mo
qian
mu
lin
fang
mian
ai
su
e
m
er
man
dong
qiang
deng
ba
xiong
cong
tian
xian
gun
dan
dao
xing
jun
xin
sui
huang
ke
gang
ri
ning
gou
ben
ya
se
wang
tai
jia
fu
li
qiu
bao
meng
jin
qi
ru
ce
shu
xun
gu
🐬
🤓
😏
🤩
💞
wong
gui
ci
chao
xue
tuan
wei
nv
cheng
zhan
lve
wo
jian
piao
yong
ding
nin
wu
ti
gao
ju
feng
biao
hen
diao
chang
shan
zhai
han
pu
xuan
ze
lu
hu
yin
huo
nao
duan
chi
sheng
zhuan
liu
shui
gong
gai
zen
cao
ne
xi
bi
suo
zou
dai
gen
yuan
ni
luo
guan
pei
cai
bai
mai
huan
gan
rang
zhou
chui
cang
la
hei
kuai
zhang
cun
qun
diu
lian
kao
💛
🎵
🏆
✌️
💦
zao
suan
mao
ca
jiao
quan
pen
sai
kong
ting
jiang
bo
ku
niu
zong
hong
lv
chuai
zhuang
min
dang
bang
duo
lo
che
she
🤝
🍾
✋
💋
zhui
bian
qia
chou
ping
zui
wai
zhuo
nian
chun
kai
🌸
😊
❤️‍🔥
😂
🌠
🎈
❤️
kou
🌹
😆
🥳
😇
😉
👌
🤞
🎯
nei
qiao
nong
huai
que
lun
tan
sun
sang
bing
ka
guang
mou
lei
ling
cu
pa
sou
tiao
lan
chuang
za
ha
gua
xie
qie
tuo
nie
miao
lang
wa
rong
en
juan
an
fou
qin
shao
san
kui
xiu
rui
po
☁️
🆒
🦕
💎
👦
😳
😘
🎮
shuai
tie
geng
💃
🙌
😄
☀️
🍒
😁
✨
🙂
💚
🎀
🤲
🌷
💌
🥲
🪅
🎉
🤑
🌟
zhua
tang
kuo
chong
pai
bin
⚡
😋
ken
zhao
beng
ceng
chen
🩷
🌴
💍
❣️
kua
zhun
song
luan
ruan
die
guai
ng
nve
chan
lie
ruo
🍓
🎇
can
tao
ou
⭐
🕺
🤍
keng
🫶
☺️
🌙
yun
💖
👍
hang
🦋
💓
🌈
🎊
🥂
🌃
🎁
💫
💥
cuo
kuan
kun
🎎
🦬
🧺
👅
🐵
❇️
↖️
😀
🤡
🤨
🌻
🥹
🫡
🎆
💙
🫵
🫰
🤭
🖐️
🚀
🎶
run
kang
nuo
niao
cui
💪
dia
pang
lia
re
😍
🌊
dun
lou
🤎
🌲
☝️
rou
🍻
🍎
😓
😪
♀️
😲
👎
💨
😖
🐟
☠️
😝
👐
👏
🧡
😻
🪐
hun
reng
🦄
💐
💘
😼
💯
shuang
🌼
🤟
den
kuang
shua
yo
zeng
leng
nuan
🦍
👕
🏒
🏌️‍♂️
zha
👆
sao
zun
nai
teng
nu
🍌
🤏
💟
❄️
⚡️
👙
🙅‍♂️
💅
💧
🤙
💝
💗
🖤
💜
😚
🫦
🆚
💹
♑️
😅
⬅️
📱
🤸
🌿
mang
🌪️
👄
🔆
😑
🐾
💄
☔️
❗️
👑
🤗
cuan
fo
🌺
zuan
🏉
🏹
🪓
🩱
📷
ei
niang
🌐
🥄
🌵
🤮
⚱️
🦧
🙉
zan
🍁
🌧
🚳
🪒
🔱
🍹
🐂
😹
🌫️
👠
💕
🎦
🚭
🐔
💻
🔺
🎨
🤣
chai
rao
chuo
mie
tun
len
🥸
☯
🪱
🚗
😰
sen
heng
©